MYHealer/dlna-esp32/main/dlna.c
/* DLNA MediaRenderer — HTTP stream + ADF esp_audio playback
 *
 * 参考 airplay-esp32 的思路做了这些改进：
 *   - 播放状态机 + mutex，避免回调与 UI 的竞态
 *   - Stop/Seek/Next 时显式 flush pipeline（audio_element_stop_reset）
 *   - 加大 http_stream / i2s_stream ringbuffer，吸收网络抖动
 *   - HTTP 请求大小 request_size 调到 MSS 级别，减少小包开销
 *   - 软音量（vol/mute 缓存 + 事件通知），避免频繁 HAL 调用
 */

#include "esp_log.h"
#include "nvs_flash.h"
#include "board.h"
#include "esp_peripherals.h"
#include "periph_wifi.h"
#include "esp_timer.h"

#include "audio_mem.h"
#include "esp_wifi.h"
#include "esp_audio.h"
#include "esp_decoder.h"
#include "http_stream.h"
#include "i2s_stream.h"
#include "media_lib_adapter.h"
#include "audio_idf_version.h"
#include "audio_element.h"
#include "ringbuf.h"

#include "custom_dlna.h"

#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "driver/gpio.h"
#include "rotary_encoder.h"
#include "tft_display.h"
#include "lvgl_port.h"
#include "lyrics_fetch.h"
#include "esp_http_client.h"
#include "esp_jpeg_dec.h"
#include "audio_forge.h"
#include "lwip/sockets.h"
#include "lwip/netdb.h"
#define lodepng_malloc(s) heap_caps_malloc(s, MALLOC_CAP_SPIRAM)
#define lodepng_free(p)  heap_caps_free(p)
#include "extra/libs/png/lodepng.h"

#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 1, 0))
#include "esp_netif.h"
#else
#include "tcpip_adapter.h"
#endif

static const char *TAG = "DLNA_APP";

/* ── Wrap audio_forge_init: 增大默认栈 4KB→8KB ── */
extern audio_element_handle_t __real_audio_forge_init(audio_forge_cfg_t *config);
audio_element_handle_t __wrap_audio_forge_init(audio_forge_cfg_t *config)
{
    if (config && config->task_stack < 8192) {
        ESP_LOGI(TAG, "Audio_forge: stack %d -> 8192", config->task_stack);
        config->task_stack = 8192;
    }
    return __real_audio_forge_init(config);
}

#define DLNA_DEVICE_UUID "8db0797a-f01a-4949-8f59-51188b18180b"

/* ─────────────────────── 播放状态机 ─────────────────────── */
typedef enum {
    PS_NO_MEDIA = -1,
    PS_STOPPED  = 0,
    PS_PLAYING  = 1,
    PS_PAUSED   = 2,
} play_state_t;

static esp_audio_handle_t player          = NULL;
static audio_element_handle_t s_http_el   = NULL;
static audio_element_handle_t s_i2s_el    = NULL;

static SemaphoreHandle_t s_state_mux     = NULL;
static play_state_t  s_state             = PS_STOPPED;
static char         *s_track_uri         = NULL;
static int           s_vol               = 35;
static int           s_mute              = 0;
/* 断点续播：记住暂停/停止时的播放位置 */
static int           s_saved_pos_sec     = 0;
static char         *s_saved_uri         = NULL;
/* 用于 GENA 去抖：相同状态不重复 notify */
static play_state_t  s_last_notified     = PS_STOPPED;
/* 宽限期：play() 后 8 秒内不被轮询覆盖 PLAYING 状态 */
static int64_t       s_grace_until       = 0;
/* Next URI 预设 */
static char         *s_next_uri          = NULL;
static char         *s_next_metadata     = NULL;
/* 用户主动停止标志 */
static int           s_user_stopped      = 0;
/* 歌词 UI 清除请求（新歌切歌时，UI 任务处理） */
static volatile bool s_lyrics_ui_clear_pending = false;
/* 位置追踪：纯软件方案（参考 miair-next） */
static int64_t        s_play_start_us     = 0;   /* 播放开始时间（esp_timer us），0=未在播放 */
static int            s_accumulated_ms    = 0;   /* 累计已播放 ms（暂停/停止时冻结） */
static char          *s_playing_uri       = NULL; /* 当前音频管道实际加载的 URI，用于检测暂停时切歌 */
/* 主动播完检测（参考 miair-next _check_play_status）：
 * 软件位置接近曲末但底层未触发 FINISHED 时的兜底，避免控制器等不到 STOPPED 不切歌 */
static int            s_near_end_count    = 0;   /* 连续接近曲末的 tick 数 */
static bool           s_finish_notify_spawned = false; /* 防重复触发播完处理 */


/* ── 工具：获取字符串形式的 DLNA 状态 ── */
static const char *state_str(play_state_t s)
{
    switch (s) {
        case PS_PLAYING:  return "PLAYING";
        case PS_PAUSED:   return "PAUSED_PLAYBACK";
        case PS_NO_MEDIA: return "NO_MEDIA_PRESENT";
        default:          return "STOPPED";
    }
}

/* ── 写状态（持锁）── */
static void set_state(play_state_t s)
{
    if (s_state_mux) xSemaphoreTake(s_state_mux, portMAX_DELAY);
    s_state = s;
    if (s_state_mux) xSemaphoreGive(s_state_mux);

    /* GENA: 只有真正的状态变迁才 notify (async: safe from esp_audio task) */
    if (s != s_last_notified) {
        s_last_notified = s;
        custom_dlna_notify_transport_state_async();
    }
}

/* ── 读状态（持锁）── */
static play_state_t get_state(void)
{
    play_state_t s;
    if (s_state_mux) xSemaphoreTake(s_state_mux, portMAX_DELAY);
    s = s_state;
    if (s_state_mux) xSemaphoreGive(s_state_mux);
    return s;
}

/* ── Delayed STOPPED notification (forward decl) ── */
static void delayed_stop_notify(void *arg);
static void cb_next(void);
static void cb_previous(void);
static void cb_play_toggle(void);

/* ─────────────────────── Player event handler ───────────────────────
 * esp_audio 的底层事件 — 用来把我们自己的状态机和底层硬件对齐。
 * 注意：这里不能做耗时 I/O（比如 HTTP callback / GENA notify 内部 I/O
 * 会放在另外的 FreeRTOS task 里）。
 */
static void player_event_handler(esp_audio_state_t *state, void *ctx)
{
    (void)ctx;
    if (!state) return;

    ESP_LOGD(TAG, "player event: status=%d err=%d", state->status, state->err_msg);

    switch (state->status) {
        case AUDIO_STATUS_RUNNING:
            set_state(PS_PLAYING);
            /* 如果 play() 没设置追踪（非 cb_play 触发），在这里初始化 */
            if (s_play_start_us == 0) {
                s_play_start_us = esp_timer_get_time();
            }
            break;
        case AUDIO_STATUS_PAUSED:
            /* 只在用户主动 pause 时才切 PAUSED。
             * I2S 在采样率切换（audio_rate_follow_task 调 i2s_stream_set_clk）
             * 时会短暂进入 PAUSED，若无条件切状态会导致界面误显示"暂停"。 */
            if (s_user_stopped) set_state(PS_PAUSED);
            break;
        case AUDIO_STATUS_STOPPED:
            /* If we intentionally paused, ignore spurious STOPPED from esp_audio */
            if (get_state() != PS_PAUSED) set_state(PS_STOPPED);
            break;
        case AUDIO_STATUS_FINISHED:
            /* Same: don't let FINISHED clobber our PAUSED state */
            if (get_state() == PS_PAUSED) break;
            /* Don't notify STOPPED immediately — let I2S buffer drain first */
            xTaskCreatePinnedToCore(delayed_stop_notify, "stop_dly", 3072, NULL, 5, NULL, 1);
            break;
        case AUDIO_STATUS_ERROR:
            set_state(PS_STOPPED);
            break;
        default:
            break;
    }
}

/* ─────────────────────── DLNA 回调桥 ─────────────────────── */
static bool is_video_uri(const char *uri);  /* forward decl */

static const char *cb_get_transport_state(void) { return state_str(get_state()); }
static const char *cb_get_uri(void)             { return s_track_uri ? s_track_uri : ""; }

static int cb_get_position_sec(void)
{
    if (get_state() == PS_PLAYING && s_play_start_us > 0) {
        int elapsed_ms = (int)((esp_timer_get_time() - s_play_start_us) / 1000LL);
        return (s_accumulated_ms + elapsed_ms) / 1000;
    }
    return s_accumulated_ms / 1000;
}

