MYHealer/dlna-esp32/main/dlna.c
static int cb_get_position_ms(void)
{
    if (get_state() == PS_PLAYING && s_play_start_us > 0) {
        int elapsed_ms = (int)((esp_timer_get_time() - s_play_start_us) / 1000LL);
        return s_accumulated_ms + elapsed_ms;
    }
    return s_accumulated_ms;
}

static int s_dur_cache_sec = 0;  /* 最近一次有效时长（秒） */

/* ── 当前歌曲信息（从 DIDL-Lite metadata 解析）── */
static char s_cur_title[128]  = "";
static char s_cur_artist[128] = "";

/* ── HTML 转义还原（DIDL-Lite 经过 HTML 编码）── */
static void html_unescape(char *dst, int dst_size, const char *src, int src_len)
{
    int di = 0;
    for (int i = 0; i < src_len && di < dst_size - 1; i++) {
        if (src[i] == '&') {
            if (strncmp(&src[i], "&amp;", 5) == 0)      { dst[di++] = '&';  i += 4; }
            else if (strncmp(&src[i], "&lt;", 4) == 0)   { dst[di++] = '<';  i += 3; }
            else if (strncmp(&src[i], "&gt;", 4) == 0)   { dst[di++] = '>';  i += 3; }
            else if (strncmp(&src[i], "&quot;", 6) == 0)  { dst[di++] = '"';  i += 5; }
            else if (strncmp(&src[i], "&apos;", 6) == 0)  { dst[di++] = '\''; i += 5; }
            else { dst[di++] = src[i]; }
        } else {
            dst[di++] = src[i];
        }
    }
    dst[di] = '\0';
}

/* 从 DIDL-Lite XML 中提取标签内容（HTML 转义版本） */
static int extract_tag(char *out, int out_size, const char *xml, const char *tag)
{
    /* 搜索 &lt;tagname...&gt; 或 &lt;tagname/&gt;（支持标签带属性） */
    char open_pat[48], close[48];
    snprintf(open_pat, sizeof(open_pat), "&lt;%s", tag);
    snprintf(close, sizeof(close), "&lt;/%s&gt;", tag);

    const char *p = strstr(xml, open_pat);
    if (!p) {
        /* 未转义形式 <tagname...> */
        char open2[32], close2[32];
        snprintf(open2, sizeof(open2), "<%s", tag);
        snprintf(close2, sizeof(close2), "</%s>", tag);
        p = strstr(xml, open2);
        if (!p) return -1;
        p += strlen(open2);
        while (*p && *p != '>' && !(*p == '/' && *(p+1) == '>')) p++;
        if (*p == '>') p++;
        else if (*p == '/') p += 2;
        if (!*p) return -1;
        const char *end = strstr(p, close2);
        if (!end) return -1;
        html_unescape(out, out_size, p, end - p);
        return 0;
    }
    /* 跳过 &lt;tagname，找到下一个 &gt; 或 > */
    p += strlen(open_pat);
    while (*p) {
        if (strncmp(p, "&gt;", 4) == 0) { p += 4; break; }
        if (*p == '>') { p++; break; }
        if (*p == '/' && *(p+1) == '>') { p += 2; break; }
        p++;
    }
    if (!*p) return -1;
    const char *end = strstr(p, close);
    if (!end) return -1;
    html_unescape(out, out_size, p, end - p);
    return 0;
}

static void parse_duration_from_metadata(const char *meta)
{
    if (!meta) return;
    /* 搜索 duration=&quot; （HTML 转义的引号） */
    const char *p = strstr(meta, "duration=&quot;");
    if (!p) {
        /* 也尝试未转义的形式 */
        p = strstr(meta, "duration=\"");
        if (!p) return;
        p += 10;
    } else {
        p += 15; /* skip 'duration=&quot;' */
    }
    int h = 0, m = 0, s = 0;
    if (sscanf(p, "%d:%d:%d", &h, &m, &s) >= 2) {
        int total = h * 3600 + m * 60 + s;
        if (total > 0) {
            s_dur_cache_sec = total;
            ESP_LOGI(TAG, "Parsed duration from metadata: %02d:%02d:%02d = %d sec",
                     h, m, s, total);
        }
    }
}

static int cb_get_duration_sec(void)
{
    play_state_t st = get_state();
    if (st == PS_STOPPED || st == PS_NO_MEDIA) return 0;
    /* 优先返回从 metadata 解析的时长（准确），
     * 不再依赖 esp_audio_duration_get（返回的是解码累计时间，不是歌曲时长） */
    return s_dur_cache_sec;
}

static int cb_get_volume(void) { return s_mute ? 0 : s_vol; }
static int cb_get_mute(void)   { return s_mute; }

/* ── 音量防抖：滑动时只应用最终值 ── */
static esp_timer_handle_t s_vol_debounce = NULL;
static int s_vol_pending = -1;

static void _vol_debounce_cb(void *arg)
{
    (void)arg;
    if (s_i2s_el && s_vol_pending >= 0) {
        int diff = 100 - s_vol_pending;
        int alc_gain = -(diff * diff * 30) / 10000;
        i2s_alc_volume_set(s_i2s_el, alc_gain);
        ESP_LOGI(TAG, "vol=%d -> alc_gain=%d", s_vol_pending, alc_gain);
        s_vol_pending = -1;
    }
}

/* ── 自定义 vol_set：映射 0-100 到 ALC 增益（防抖）
 *    平方曲线：低音量时下降更慢，保留更多有效位
 *    vol=100 → 0dB, vol=50 → -7.5dB, vol=0 → -30dB
 *    对比线性：vol=50 → -15dB（平方在 50% 音量时保真度更高）
 */
static esp_err_t _my_vol_set(void *handle, int volume)
{
    if (!s_i2s_el) return ESP_ERR_INVALID_STATE;
    s_vol_pending = volume;
    if (!s_vol_debounce) {
        /* 首次调用时创建定时器 */
        const esp_timer_create_args_t args = {
            .callback = _vol_debounce_cb,
            .name = "vol_debounce",
        };
        esp_timer_create(&args, &s_vol_debounce);
    }
    /* 重置定时器：50ms 内无新值才真正应用 */
    esp_timer_stop(s_vol_debounce);
    esp_timer_start_once(s_vol_debounce, 50000);
    return ESP_OK;
}

static esp_err_t _my_vol_get(void *handle, int *volume)
{
    if (volume) *volume = s_vol;
    return ESP_OK;
}

/* ── 把音量 / 静音状态落到 ALC 并通知 GENA ── */
static void apply_volume_hw(void)
{
    int hw = s_mute ? 0 : s_vol;
    _my_vol_set(NULL, hw);
    custom_dlna_notify_rcs();
}

static void cb_set_uri(const char *uri)
{
    s_finish_notify_spawned = false;
    s_near_end_count = 0;
    /* 视频过滤 */
    if (uri && is_video_uri(uri)) {
        ESP_LOGW(TAG, "Rejected video URI: %.128s", uri);
        return;
    }
    if (s_state_mux) xSemaphoreTake(s_state_mux, portMAX_DELAY);
    /* 新 URI 不同于保存的 URI 时，清除断点 */
    if (uri && s_saved_uri && strcmp(uri, s_saved_uri) != 0) {
        s_saved_pos_sec = 0;
        free(s_saved_uri);
        s_saved_uri = NULL;
    }
    free(s_track_uri);
    s_track_uri = uri ? strdup(uri) : NULL;
    /* 新 URI → 重置时长缓存 + 歌词 */
    s_dur_cache_sec = 0;
    s_cur_title[0] = '\0';
    s_cur_artist[0] = '\0';
    lyrics_clear();
    s_lyrics_ui_clear_pending = true;  /* 通知 UI 任务清除歌词标签 */
    /* 状态转换：设置 URI 后从 NO_MEDIA → STOPPED */
    if (s_state == PS_NO_MEDIA && s_track_uri) {
        s_state = PS_STOPPED;
    }
    s_user_stopped = 0;
    if (s_state_mux) xSemaphoreGive(s_state_mux);
    ESP_LOGI(TAG, "SetURI: %s", s_track_uri ? s_track_uri : "(null)");
}

/* ── 播完处理：支持 next_uri 自动切换 + 防重复触发 ── */
static void delayed_stop_notify(void *arg)
{
    (void)arg;
    if (s_finish_notify_spawned) { vTaskDelete(NULL); return; }
    s_finish_notify_spawned = true;

    /* 冻结最终位置 */
    if (s_play_start_us > 0) {
        s_accumulated_ms += (int)((esp_timer_get_time() - s_play_start_us) / 1000LL);
        s_play_start_us = 0;
    }

