MYHealer/dlna-esp32/main/dlna.c
    /* 有预载的下一首 → 自动续播（参考 miair-next _check_play_status） */
    if (s_next_uri && s_next_uri[0]) {
        ESP_LOGI(TAG, "Track finished, auto-playing next: %s", s_next_uri);
        s_accumulated_ms = 0;
        s_near_end_count = 0;
        s_finish_notify_spawned = false;
        cb_next();
        vTaskDelete(NULL);
        return;
    }

    /* 否则发 STOPPED，让控制器推下一首 */
    set_state(PS_STOPPED);
    ESP_LOGI(TAG, "Track finished -> STOPPED (dur=%d ms)", s_accumulated_ms);
    s_accumulated_ms = 0;
    s_near_end_count = 0;
    s_finish_notify_spawned = false;
    vTaskDelete(NULL);
}

static void _do_play(const char *uri, int seek_sec)
{
    s_finish_notify_spawned = false;
    s_near_end_count = 0;
    if (!player || !uri) return;
    esp_err_t err = esp_audio_play(player, AUDIO_CODEC_TYPE_DECODER, uri, 0);
    if (err == ESP_OK) {
        set_state(PS_PLAYING);
        s_accumulated_ms = seek_sec * 1000;
        s_play_start_us = esp_timer_get_time();
        s_grace_until = esp_timer_get_time() + 8000000LL;
        s_user_stopped = 0;
        free(s_playing_uri);
        s_playing_uri = strdup(uri);
        if (seek_sec > 0) {
            vTaskDelay(pdMS_TO_TICKS(300));
            esp_audio_seek(player, seek_sec);
            ESP_LOGI(TAG, "Resumed from %d s (seek)", seek_sec);
        }
    } else {
        ESP_LOGE(TAG, "esp_audio_play failed: 0x%x", err);
        set_state(PS_STOPPED);
    }
}

static void cb_play(void)
{
    play_state_t cur = get_state();
    ESP_LOGI(TAG, "Play (state=%d, saved_uri=%s, saved_pos=%d)",
             cur, s_saved_uri ? s_saved_uri : "(null)", s_saved_pos_sec);

    if (cur == PS_PLAYING) {
        /* 正在播放中收到 Play：同 URL 忽略，新 URL 停旧播新 */
        if (s_playing_uri && s_track_uri && strcmp(s_playing_uri, s_track_uri) == 0) {
            ESP_LOGI(TAG, "Play while playing, same URL, ignored");
            return;
        }
        ESP_LOGI(TAG, "Play while playing, new URL, switching");
        esp_audio_stop(player, TERMINATION_TYPE_NOW);
        vTaskDelay(pdMS_TO_TICKS(50));
        _do_play(s_track_uri, 0);
        return;
    }

    if (cur == PS_PAUSED && player) {
        /* 检查暂停期间是否推了新 URL */
        bool uri_changed = s_playing_uri && s_track_uri
                          && strcmp(s_playing_uri, s_track_uri) != 0;
        if (uri_changed) {
            ESP_LOGI(TAG, "URI changed while paused, switching to new track");
            esp_audio_resume(player);
            vTaskDelay(pdMS_TO_TICKS(50));
            esp_audio_stop(player, TERMINATION_TYPE_NOW);
            vTaskDelay(pdMS_TO_TICKS(50));
            _do_play(s_track_uri, 0);
        } else {
            /* 同 URI 恢复暂停 */
            esp_audio_resume(player);
            set_state(PS_PLAYING);
            s_play_start_us = esp_timer_get_time();
            ESP_LOGI(TAG, "Resumed from pause (pos=%d ms)", s_accumulated_ms);
        }
        s_grace_until = esp_timer_get_time() + 8000000LL;
        s_user_stopped = 0;
        return;
    }

    /* 新播放 or 断点续播 */
    if (s_track_uri != NULL && player != NULL) {
        bool same_track = s_saved_uri && s_track_uri
                          && strcmp(s_saved_uri, s_track_uri) == 0
                          && s_saved_pos_sec > 0;
        _do_play(s_track_uri, same_track ? s_saved_pos_sec : 0);
    }
    s_saved_pos_sec = 0;
}

static void cb_pause(void)
{
    play_state_t cur = get_state();
    ESP_LOGI(TAG, "Pause (state=%d)", cur);
    if (player && cur == PS_PLAYING) {
        /* 冻结累计播放时间 */
        if (s_play_start_us > 0) {
            s_accumulated_ms += (int)((esp_timer_get_time() - s_play_start_us) / 1000LL);
            s_play_start_us = 0;
        }
        s_saved_pos_sec = s_accumulated_ms / 1000;
        free(s_saved_uri);
        s_saved_uri = s_track_uri ? strdup(s_track_uri) : NULL;
        esp_err_t err = esp_audio_pause(player);
        set_state(PS_PAUSED);
        s_user_stopped = 1;
        ESP_LOGI(TAG, "Paused at %d ms (err=0x%x)", s_accumulated_ms, err);
    }
}

/* ── 播放/暂停切换（旋钮播放按钮） ── */
static void cb_play_toggle(void)
{
    play_state_t cur = get_state();
    if (cur == PS_PLAYING) {
        cb_pause();
    } else {
        cb_play();
    }
}

static void cb_stop(void)
{
    s_finish_notify_spawned = false;
    s_near_end_count = 0;
    ESP_LOGI(TAG, "Stop");
    /* 冻结累计播放时间 */
    if (s_play_start_us > 0) {
        s_accumulated_ms += (int)((esp_timer_get_time() - s_play_start_us) / 1000LL);
        s_play_start_us = 0;
    }
    s_saved_pos_sec = s_accumulated_ms / 1000;
    free(s_saved_uri);
    s_saved_uri = s_track_uri ? strdup(s_track_uri) : NULL;
    if (player) esp_audio_stop(player, TERMINATION_TYPE_NOW);
    set_state(PS_STOPPED);
    s_user_stopped = 1;
    free(s_next_uri); s_next_uri = NULL;
    free(s_next_metadata); s_next_metadata = NULL;
    ESP_LOGI(TAG, "Stopped at %d ms", s_accumulated_ms);
}

/* ── Seek 防抖：拖动进度条时 controller 连发多个 Seek，只执行最后一个 ── */
static void cb_seek(int seconds)
{
    s_finish_notify_spawned = false;
    s_near_end_count = 0;
    ESP_LOGI(TAG, "Seek %d s", seconds);
    if (!player) return;
    esp_audio_seek(player, seconds);
    /* 更新位置追踪 */
    s_accumulated_ms = seconds * 1000;
    s_play_start_us = esp_timer_get_time();
}

static void cb_set_volume(int v)
{
    s_vol = v;
    if (s_mute) {
        /* 用户在静音状态下调音量 —— 顺手取消静音更自然 */
        s_mute = 0;
    }
    apply_volume_hw();
}

static void cb_set_mute(int m)
{
    s_mute = m ? 1 : 0;
    apply_volume_hw();
}

/* ── 视频过滤：检测 URI 是否指向视频文件 ── */
static bool is_video_uri(const char *uri)
{
    if (!uri) return false;
    const char *exts[] = { ".mp4", ".mov", ".avi", ".mkv", ".flv", ".wmv",
                           ".m4v", ".3gp", ".ts", ".mts", ".m2ts", NULL };
    /* 找到 URI 的路径部分（跳过 scheme://host） */
    const char *path = strstr(uri, "://");
    if (path) path += 3; else path = uri;
    path = strchr(path, '/');  /* 找到第一个 / */
    if (!path) return false;
    int plen = strlen(path);
    for (int i = 0; exts[i]; i++) {
        int elen = strlen(exts[i]);
        if (plen >= elen) {
            const char *tail = path + plen - elen;
            if (strncasecmp(tail, exts[i], elen) == 0) return true;
        }
    }
    if (strstr(uri, "video/")) return true;
    return false;
}

/* Next / Previous */
static void cb_next(void) {
    ESP_LOGI(TAG, "Next (next_uri=%s) state=%d", s_next_uri ? s_next_uri : "(null)", (int)get_state());
    int was_paused = (get_state() == PS_PAUSED);
    s_accumulated_ms = 0;
    s_play_start_us = 0;
    s_saved_pos_sec = 0;
    free(s_saved_uri); s_saved_uri = NULL;
    if (s_next_uri && s_next_uri[0]) {
        char *next_meta = s_next_metadata;
        if (player) {
            /* 暂停状态下 esp_audio_stop 不工作，先 resume 再 stop */
            if (was_paused) esp_audio_resume(player);
            vTaskDelay(pdMS_TO_TICKS(50));
            esp_audio_stop(player, TERMINATION_TYPE_NOW);
        }
        free(s_track_uri);
        s_track_uri = s_next_uri;
        s_next_uri = NULL;
        s_next_metadata = NULL;
        if (player) {
            esp_audio_play(player, AUDIO_CODEC_TYPE_DECODER, s_track_uri, 0);
            s_play_start_us = esp_timer_get_time();
            free(s_playing_uri);
            s_playing_uri = strdup(s_track_uri);
            set_state(PS_PLAYING);
            if (was_paused) {
                vTaskDelay(pdMS_TO_TICKS(300));
                esp_audio_pause(player);
                set_state(PS_PAUSED);
            }
        }
        custom_dlna_update_uri(s_track_uri, next_meta);
        free(next_meta);
    } else {
        /* 无 next_uri → 模拟自然播完（参考 miair-next next_track()）：
         * 位置设到曲末 + STOPPED，控制端判定自然结束自动推下一首 */
        if (player) {
            if (get_state() == PS_PAUSED) esp_audio_resume(player);
            vTaskDelay(pdMS_TO_TICKS(50));
            esp_audio_stop(player, TERMINATION_TYPE_NOW);
        }
        if (s_dur_cache_sec > 0) {
            s_accumulated_ms = s_dur_cache_sec * 1000;  /* 位置=曲末 */
        }
        s_play_start_us = 0;
        set_state(PS_STOPPED);
        custom_dlna_update_uri(NULL, NULL);
    }
    custom_dlna_notify_transport_state_async();
}
static void cb_previous(void) {
    s_finish_notify_spawned = false;
    s_near_end_count = 0;
    ESP_LOGI(TAG, "Previous");
    s_accumulated_ms = 0;
    s_play_start_us = 0;
    s_saved_pos_sec = 0;
    free(s_saved_uri); s_saved_uri = NULL;
    if (player && s_track_uri) {
        esp_audio_stop(player, TERMINATION_TYPE_NOW);
        vTaskDelay(pdMS_TO_TICKS(200));
        esp_audio_play(player, AUDIO_CODEC_TYPE_DECODER, s_track_uri, 0);
        set_state(PS_PLAYING);
        s_play_start_us = esp_timer_get_time();
    } else {
        if (player) esp_audio_stop(player, TERMINATION_TYPE_NOW);
        set_state(PS_STOPPED);
    }
    custom_dlna_notify_transport_state_async();
}

static void cb_set_next_uri(const char *uri, const char *metadata)
{
    ESP_LOGI(TAG, "SetNextURI: %s", uri ? uri : "(null)");
    free(s_next_uri);
    s_next_uri = uri ? strdup(uri) : NULL;
    free(s_next_metadata);
    s_next_metadata = metadata ? strdup(metadata) : NULL;
}

static void fetch_album_art_async(const char *url);

