MYHealer/dlna-esp32/main/dlna.c
/* 简易 HTML 实体解码：将 &#xxxxx; 转为 UTF-8 */
static void decode_html_entities(char *dst, size_t dst_size, const char *src)
{
    size_t pos = 0;
    while (*src && pos + 6 < dst_size) {
        if (*src == '&' && *(src + 1) == '#') {
            src += 2; /* 跳过 &# */
            unsigned long codepoint = 0;
            while (*src >= '0' && *src <= '9') {
                codepoint = codepoint * 10 + (*src - '0');
                src++;
            }
            if (*src == ';') src++; /* 跳过 ; */
            /* 将 Unicode code point 编码为 UTF-8 */
            if (codepoint < 0x80) {
                dst[pos++] = codepoint;
            } else if (codepoint < 0x800) {
                dst[pos++] = 0xC0 | (codepoint >> 6);
                dst[pos++] = 0x80 | (codepoint & 0x3F);
            } else if (codepoint < 0x10000) {
                dst[pos++] = 0xE0 | (codepoint >> 12);
                dst[pos++] = 0x80 | ((codepoint >> 6) & 0x3F);
                dst[pos++] = 0x80 | (codepoint & 0x3F);
            } else {
                dst[pos++] = 0xF0 | (codepoint >> 18);
                dst[pos++] = 0x80 | ((codepoint >> 12) & 0x3F);
                dst[pos++] = 0x80 | ((codepoint >> 6) & 0x3F);
                dst[pos++] = 0x80 | (codepoint & 0x3F);
            }
        } else {
            dst[pos++] = *src;
            src++;
        }
    }
    dst[pos] = '\0';
}

static void cb_set_metadata(const char *metadata)
{
    ESP_LOGI(TAG, "Metadata: %s", metadata);
    parse_duration_from_metadata(metadata);

    char title[256] = "", artist[256] = "", album_art[256] = "";
    char music_id_str[32] = "";
    extract_tag(title, sizeof(title), metadata, "dc:title");
    extract_tag(artist, sizeof(artist), metadata, "upnp:artist");
    extract_tag(album_art, sizeof(album_art), metadata, "upnp:albumArtURI");
    extract_tag(music_id_str, sizeof(music_id_str), metadata, "netease:musicId");
    unsigned long music_id = music_id_str[0] ? strtoul(music_id_str, NULL, 10) : 0;
    ESP_LOGI(TAG, "Extracted: title='%s' artist='%s' musicId=%lu", title, artist, music_id);

    if (album_art[0]) {
        /* 没有参数时追加 ?param=200y200 让 CDN 返回小图，节省内存 */
        if (!strchr(album_art, '?')) {
            strncat(album_art, "?param=300y300", sizeof(album_art) - strlen(album_art) - 1);
        }
        ESP_LOGI(TAG, "AlbumArt URL: %s", album_art);
        fetch_album_art_async(album_art);
    }

    if (title[0] && (strcmp(title, s_cur_title) != 0 || strcmp(artist, s_cur_artist) != 0)) {
        decode_html_entities(s_cur_title, sizeof(s_cur_title), title);
        decode_html_entities(s_cur_artist, sizeof(s_cur_artist), artist);
        ESP_LOGI(TAG, "Song: %s - %s", s_cur_title, s_cur_artist);
        lvgl_port_lock();
        lvgl_port_ui_set_title(s_cur_title);
        lvgl_port_ui_set_artist(s_cur_artist);
        lvgl_port_unlock();
        ESP_LOGI(TAG, "Calling lyrics_fetch_async for: %s - %s (songId=%d)", s_cur_title, s_cur_artist, music_id);
        lyrics_fetch_async(s_cur_title, s_cur_artist, music_id);
    }
}

/* ─────────────────────── 专辑封面下载与解码 ─────────────────────── */

/* ── 用原始 socket 下载封面，全部走 PSRAM，避免 esp_http_client 争抢内部 RAM ── */
static int simple_http_get(const char *url, uint8_t **out_data, int *out_len)
{
    /* 解析 URL: http://host[:port]/path */
    const char *p = url;
    if (strncmp(p, "http://", 7) == 0) p += 7;
    else { ESP_LOGW(TAG, "Only http supported"); return -1; }

    char host[128] = "";
    int port = 80;
    const char *path = "/";
    /* 提取 host */
    int i = 0;
    while (*p && *p != '/' && *p != ':' && i < 127) host[i++] = *p++;
    host[i] = '\0';
    if (*p == ':') { p++; port = atoi(p); while (*p && *p != '/') p++; }
    if (*p == '/') path = p;

    /* DNS 解析 */
    struct addrinfo hints = { .ai_family = AF_INET, .ai_socktype = SOCK_STREAM };
    struct addrinfo *res = NULL;
    char port_str[8];
    snprintf(port_str, sizeof(port_str), "%d", port);
    if (getaddrinfo(host, port_str, &hints, &res) != 0 || !res) {
        ESP_LOGW(TAG, "DNS failed: %s", host);
        return -1;
    }

    /* 创建 socket */
    int sock = socket(AF_INET, SOCK_STREAM, 0);
    if (sock < 0) { freeaddrinfo(res); return -1; }

    /* 设置超时 */
    struct timeval tv = { .tv_sec = 10 };
    setsockopt(sock, SOL_SOCKET, SO_RCVTIMEO, &tv, sizeof(tv));

    if (connect(sock, res->ai_addr, res->ai_addrlen) < 0) {
        close(sock); freeaddrinfo(res);
        ESP_LOGW(TAG, "TCP connect failed: %s:%d", host, port);
        return -1;
    }
    freeaddrinfo(res);

    /* 发送 HTTP GET */
    char req[512];
    int req_len = snprintf(req, sizeof(req),
        "GET %s HTTP/1.0\r\nHost: %s\r\nConnection: close\r\n\r\n", path, host);
    send(sock, req, req_len, 0);

    /* 读取响应到 PSRAM 缓冲区（动态扩容，确保完整下载） */
    int cap = 256 * 1024;  /* 初始 256KB，足够大图 */
    uint8_t *buf = heap_caps_malloc(cap, MALLOC_CAP_SPIRAM);
    if (!buf) { close(sock); return -1; }

    int total = 0, hdr_end = 0;
    for (;;) {
        int r = recv(sock, buf + total, cap - total - 1, 0);
        if (r <= 0) break;  /* 0=对端关闭, <0=错误 */
        total += r;
        /* 查找 HTTP 头结束标记 */
        if (!hdr_end) {
            for (int j = 0; j < total - 3; j++) {
                if (buf[j] == '\r' && buf[j+1] == '\n' && buf[j+2] == '\r' && buf[j+3] == '\n') {
                    hdr_end = j + 4;
                    break;
                }
            }
        }
        /* 缓冲区将满时扩容（PSRAM 有足够空间） */
        if (total > cap - 4096) {
            int new_cap = cap + 128 * 1024;
            uint8_t *new_buf = heap_caps_realloc(buf, new_cap, MALLOC_CAP_SPIRAM);
            if (!new_buf) break;  /* 扩容失败，用已有数据 */
            buf = new_buf;
            cap = new_cap;
        }
    }
    close(sock);

    if (!hdr_end || total - hdr_end < 4) {
        ESP_LOGW(TAG, "HTTP response too small: %d (hdr_end=%d)", total, hdr_end);
        heap_caps_free(buf);
        return -1;
    }

    int body_len = total - hdr_end;
    ESP_LOGI(TAG, "HTTP response: total=%d, headers=%d, body=%d", total, hdr_end, body_len);
    /* 分配干净的 body 缓冲区（PSRAM） */
    uint8_t *body = heap_caps_malloc(body_len, MALLOC_CAP_SPIRAM);
    if (!body) { heap_caps_free(buf); return -1; }
    memcpy(body, buf + hdr_end, body_len);
    heap_caps_free(buf);

    *out_data = body;
    *out_len = body_len;
    ESP_LOGI(TAG, "Cover downloaded: %d bytes", body_len);
    return 0;
}

static void album_art_task(void *arg)
{
    const char *url = (const char *)arg;
    if (!url) { free(arg); vTaskDelete(NULL); return; }

    /* 等音频管线稳定 */
    vTaskDelay(pdMS_TO_TICKS(3000));

    uint8_t *img_data = NULL;
    int img_len = 0;
    if (simple_http_get(url, &img_data, &img_len) != 0) {
        ESP_LOGW(TAG, "Cover download failed");
        free(arg);
        vTaskDelete(NULL);
        return;
    }

