MYHealer/dlna-esp32/main/dlna.c
    /* 检测图片格式并解码 */
    ESP_LOGI(TAG, "Image data: len=%d, first4=%02X %02X %02X %02X",
             img_len, img_data[0], img_data[1], img_data[2], img_data[3]);
    int out_w = 0, out_h = 0;
    uint16_t *out_buf = NULL;
    bool jpeg_aligned = false;  /* JPEG 用 jpeg_calloc_align 分配 */

    if (img_data[0] == 0xFF && img_data[1] == 0xD8) {
        /* ====== JPEG 解码（esp_new_jpeg，支持 progressive） ====== */
        jpeg_dec_config_t dec_cfg = DEFAULT_JPEG_DEC_CONFIG();
        dec_cfg.output_type = JPEG_PIXEL_FORMAT_RGB565_LE;  /* 小端序，CPU 直接读 */
        jpeg_dec_handle_t jpeg_dec = NULL;
        jpeg_error_t jerr = jpeg_dec_open(&dec_cfg, &jpeg_dec);
        if (jerr != JPEG_ERR_OK) {
            ESP_LOGW(TAG, "JPEG open failed: %d", jerr);
            heap_caps_free(img_data); free(arg); vTaskDelete(NULL); return;
        }

        /* 直接解码全尺寸（DEFAULT_JPEG_DEC_CONFIG 已禁用 scale） */

        jpeg_dec_io_t io = { .inbuf = img_data, .inbuf_len = img_len };
        jpeg_dec_header_info_t info;
        jerr = jpeg_dec_parse_header(jpeg_dec, &io, &info);
        if (jerr != JPEG_ERR_OK) {
            ESP_LOGW(TAG, "JPEG header parse failed: %d", jerr);
            jpeg_dec_close(jpeg_dec);
            heap_caps_free(img_data); free(arg); vTaskDelete(NULL); return;
        }
        out_w = info.width;
        out_h = info.height;

        int outbuf_len = 0;
        jpeg_dec_get_outbuf_len(jpeg_dec, &outbuf_len);
        uint8_t *raw_buf = (uint8_t *)jpeg_calloc_align(outbuf_len, 16);
        if (!raw_buf) {
            ESP_LOGW(TAG, "JPEG outbuf alloc failed (%d)", outbuf_len);
            jpeg_dec_close(jpeg_dec);
            heap_caps_free(img_data); free(arg); vTaskDelete(NULL); return;
        }

        /* 关键：parse_header 已消费头部字节，inbuf_remain 是剩余未用字节。
           必须把 inbuf 指针前移到 SOS 段位置再交给 process 解码 */
        int consumed = io.inbuf_len - io.inbuf_remain;
        io.outbuf = raw_buf;
        io.out_size = outbuf_len;
        io.inbuf = img_data + consumed;
        io.inbuf_len = io.inbuf_remain;
        jerr = jpeg_dec_process(jpeg_dec, &io);
        jpeg_dec_close(jpeg_dec);
        if (jerr != JPEG_ERR_OK) {
            ESP_LOGW(TAG, "JPEG decode failed: %d", jerr);
            jpeg_free_align(raw_buf);
            heap_caps_free(img_data); free(arg); vTaskDelete(NULL); return;
        }

        /* BGR565_BE + 中心裁剪 + 双线性缩放到 48x48 */
        int min_dim = out_w < out_h ? out_w : out_h;
        int crop_sz = min_dim;
        int crop_x = (out_w - crop_sz) / 2;
        int crop_y = (out_h - crop_sz) / 2;
        #define JPEG_MAX_COVER 48
        int sw = JPEG_MAX_COVER, sh = JPEG_MAX_COVER;
        uint16_t *resized = (uint16_t *)heap_caps_malloc(sw * sh * 2, MALLOC_CAP_SPIRAM);
        if (!resized) {
            ESP_LOGW(TAG, "JPEG resize alloc failed");
            jpeg_free_align(raw_buf);
            heap_caps_free(img_data); free(arg); vTaskDelete(NULL); return;
        }
        uint16_t *src = (uint16_t *)raw_buf;
        for (int y = 0; y < sh; y++) {
            float fy = crop_y + (float)y / sh * crop_sz;
            for (int x = 0; x < sw; x++) {
                float fx = crop_x + (float)x / sw * crop_sz;
                int ix = (int)fx, iy = (int)fy;
                if (ix >= out_w - 1) ix = out_w - 2;
                if (iy >= out_h - 1) iy = out_h - 2;
                float dx = fx - ix, dy = fy - iy;
                /* 四个邻近像素（RGB565_BE，已含 BGR 交换前的原始数据） */
                uint16_t p00 = src[iy * out_w + ix];
                uint16_t p01 = src[iy * out_w + ix + 1];
                uint16_t p10 = src[(iy + 1) * out_w + ix];
                uint16_t p11 = src[(iy + 1) * out_w + ix + 1];
                /* 分通道双线性插值（RGB565: R=5bit, G=6bit, B=5bit） */
                int r = (int)((((p00>>11)&0x1F)*(1-dx) + ((p01>>11)&0x1F)*dx)*(1-dy) +
                              (((p10>>11)&0x1F)*(1-dx) + ((p11>>11)&0x1F)*dx)*dy);
                int g = (int)((((p00>>5)&0x3F)*(1-dx) + ((p01>>5)&0x3F)*dx)*(1-dy) +
                              (((p10>>5)&0x3F)*(1-dx) + ((p11>>5)&0x3F)*dx)*dy);
                int b = (int)(((p00&0x1F)*(1-dx) + (p01&0x1F)*dx)*(1-dy) +
                              ((p10&0x1F)*(1-dx) + (p11&0x1F)*dx)*dy);
                /* BGR565 大端序（ST7735 MADCTL_BGR） */
                uint16_t c = ((b & 0x1F) << 11) | ((g & 0x3F) << 5) | (r & 0x1F);
                resized[y * sw + x] = (c >> 8) | (c << 8);
            }
        }
        jpeg_free_align(raw_buf);
        out_buf = resized;
        jpeg_aligned = false;  /* resized 用 heap_caps_malloc，不用 jpeg_free_align */
        out_w = sw; out_h = sh;
        ESP_LOGI(TAG, "JPEG decoded: %dx%d -> crop %d -> %dx%d", info.width, info.height, crop_sz, sw, sh);

    } else if (img_data[0] == 0x89 && img_data[1] == 0x50) {
        /* ====== PNG 解码（lodepng） ====== */
        unsigned png_w = 0, png_h = 0;
        uint8_t *png_rgb = NULL;
        /* 用 RGB（3 字节/像素）而非 RGBA，省 25% 内存 */
        unsigned err = lodepng_decode24(&png_rgb, &png_w, &png_h, img_data, img_len);
        if (err) {
            ESP_LOGW(TAG, "PNG decode failed: %u (%s), w=%u h=%u", err, lodepng_error_text(err), png_w, png_h);
            heap_caps_free(img_data);
            free(arg);
            vTaskDelete(NULL);
            return;
        }
        /* 下载缓冲区已无用，立即释放 */
        heap_caps_free(img_data);
        img_data = NULL;

        /* 中心裁剪 + 缩放到 48x48 */
        int min_dim = png_w < png_h ? png_w : png_h;
        int crop_sz = min_dim;
        int crop_x = (png_w - crop_sz) / 2;
        int crop_y = (png_h - crop_sz) / 2;
        #define MAX_COVER 48
        int sw = MAX_COVER, sh = MAX_COVER;

        size_t out_buf_size = sw * sh * 2;
        out_buf = (uint16_t *)heap_caps_malloc(out_buf_size, MALLOC_CAP_SPIRAM);
        if (!out_buf) {
            ESP_LOGW(TAG, "PNG out_buf alloc failed (%zu)", out_buf_size);
            free(png_rgb);
            free(arg);
            vTaskDelete(NULL);
            return;
        }
        /* 双线性缩放 + RGB888→BGR565 */
        for (int y = 0; y < sh; y++) {
            float fy = crop_y + (float)y / sh * crop_sz;
            for (int x = 0; x < sw; x++) {
                float fx = crop_x + (float)x / sw * crop_sz;
                int ix = (int)fx, iy = (int)fy;
                if (ix >= png_w - 1) ix = png_w - 2;
                if (iy >= png_h - 1) iy = png_h - 2;
                float dx = fx - ix, dy = fy - iy;
                int base = iy * png_w + ix;
                int r = (int)((png_rgb[base*3]*(1-dx) + png_rgb[(base+1)*3]*dx)*(1-dy) +
                              (png_rgb[(base+png_w)*3]*(1-dx) + png_rgb[(base+png_w+1)*3]*dx)*dy);
                int g = (int)((png_rgb[base*3+1]*(1-dx) + png_rgb[(base+1)*3+1]*dx)*(1-dy) +
                              (png_rgb[(base+png_w)*3+1]*(1-dx) + png_rgb[(base+png_w+1)*3+1]*dx)*dy);
                int b = (int)((png_rgb[base*3+2]*(1-dx) + png_rgb[(base+1)*3+2]*dx)*(1-dy) +
                              (png_rgb[(base+png_w)*3+2]*(1-dx) + png_rgb[(base+png_w+1)*3+2]*dx)*dy);
                uint16_t c = ((b >> 3) << 11) | ((g >> 2) << 5) | (r >> 3);
                out_buf[y * sw + x] = (c >> 8) | (c << 8);
            }
        }
        free(png_rgb);
        out_w = sw; out_h = sh;
        ESP_LOGI(TAG, "PNG decoded: %ux%u -> %dx%d (crop=%d)", png_w, png_h, out_w, out_h, crop_sz);

    } else {
        ESP_LOGW(TAG, "Unknown format: %02X %02X %02X %02X",
                 img_data[0], img_data[1], img_data[2], img_data[3]);
        heap_caps_free(img_data);
        free(arg);
        vTaskDelete(NULL);
        return;
    }

