MYHealer/dlna-esp32/main/dlna.c
    /* 显示封面（数据通过 memcpy 到内部 RAM 静态缓冲区，无缓存问题） */
    lvgl_port_lock();
    lvgl_port_ui_set_cover(out_buf, out_w, out_h);
    lvgl_port_unlock();

    /* 清理 */
    if (jpeg_aligned) jpeg_free_align(out_buf);
    else heap_caps_free(out_buf);
    heap_caps_free(img_data);
    free(arg);
    vTaskDelete(NULL);
}

static void fetch_album_art_async(const char *url)
{
    char *url_copy = strdup(url);
    if (!url_copy) return;
    /* Core 1: 与 WiFi (Core 0) 完全隔离，避免争抢内部 RAM */
    BaseType_t ret = xTaskCreatePinnedToCore(album_art_task, "album_art",
        8 * 1024, url_copy, 1, NULL, 1);  /* 最低优先级，避免与音频管线争抢 CPU */
    if (ret != pdPASS) {
        ESP_LOGW(TAG, "album_art task create failed: %d", ret);
        free(url_copy);
    }
}

/* ─────────────────────── HTTP stream event ─────────────────────── */
static int _http_stream_event_handle(http_stream_event_msg_t *msg)
{
    if (!msg) return ESP_OK;
    switch (msg->event_id) {
        case HTTP_STREAM_RESOLVE_ALL_TRACKS:
            return ESP_OK;
        case HTTP_STREAM_FINISH_TRACK:
            return http_stream_next_track(msg->el);
        case HTTP_STREAM_FINISH_PLAYLIST:
            return http_stream_restart(msg->el);
        default:
            return ESP_OK;
    }
}

/* ─────────────────────── Audio player init ─────────────────────── */
static void audio_player_init(void)
{
    audio_board_handle_t board_handle = audio_board_init();
    audio_hal_ctrl_codec(board_handle->audio_hal,
                         AUDIO_HAL_CODEC_MODE_DECODE,
                         AUDIO_HAL_CTRL_START);

    /* ── esp_audio 主体
     *    N16R8 有 8MB PSRAM，大胆用！
     *    prefer_type = SPEED：优先性能，减少解码延迟
     *    in_stream_buf = 512KB：HTTP→Decoder 缓冲，减少网络抖动
     *    out_stream_buf = 128KB：Decoder→I2S 缓冲，防止 underrun
     */
    esp_audio_cfg_t cfg = DEFAULT_ESP_AUDIO_CONFIG();
    cfg.vol_handle = board_handle->audio_hal;
    cfg.vol_set = (audio_volume_set)audio_hal_set_volume;
    cfg.vol_get = (audio_volume_get)audio_hal_get_volume;
    cfg.prefer_type  = ESP_AUDIO_PREFER_SPEED;
    cfg.resample_rate = 0;           /* 0=禁用重采样，I2S 跟随源采样率（参考 Jw-Y1）*/
    cfg.in_stream_buf_size  = 512 * 1024;  /* 512KB，充分吸收网络抖动 */
    cfg.out_stream_buf_size = 128 * 1024;  /* 128KB，解码后充裕缓冲 */
    cfg.task_prio   = 8;
    cfg.task_stack  = 8 * 1024;
    player = esp_audio_create(&cfg);

    /* ── HTTP stream reader
     *    out_rb = 1MB：PSRAM 大缓冲，预加载整首歌的很大一部分
     *    request_size = 32KB：大块读取，减少 HTTP RTT
     *    user_agent = 浏览器 UA：网易云对非浏览器 UA 会限速/给低码率
     *                 （参考 Jw-Y1 + miair-next 的 UA 伪装）
     *    stack_in_ext = true：任务栈放 PSRAM，节省 IRAM
     */
    http_stream_cfg_t http_cfg = HTTP_STREAM_CFG_DEFAULT();
    http_cfg.event_handle      = _http_stream_event_handle;
    http_cfg.type              = AUDIO_STREAM_READER;
    http_cfg.enable_playlist_parser = true;
    http_cfg.task_prio         = 6;
    http_cfg.task_stack        = 8 * 1024;
    http_cfg.stack_in_ext      = true;
    http_cfg.out_rb_size       = 1024 * 1024;  /* 1MB PSRAM 环形缓冲 */
    http_cfg.request_size      = 32768;         /* 32KB 请求块，减少 RTT */
    http_cfg.user_agent        = "Mozilla/5.0 (Linux; Android 12) "
                                 "AppleWebKit/537.36 (KHTML, like Gecko) "
                                 "Chrome/120.0.0.0 Mobile Safari/537.36";
    s_http_el = http_stream_init(&http_cfg);
    esp_audio_input_stream_add(player, s_http_el);

    /* ── Decoders（mp3/aac/wav/ts...）── */
    audio_decoder_t auto_decode[] = {
        DEFAULT_ESP_MP3_DECODER_CONFIG(),
        DEFAULT_ESP_WAV_DECODER_CONFIG(),
        DEFAULT_ESP_AAC_DECODER_CONFIG(),
        DEFAULT_ESP_M4A_DECODER_CONFIG(),
        DEFAULT_ESP_TS_DECODER_CONFIG(),
    };
    esp_decoder_cfg_t auto_dec_cfg = DEFAULT_ESP_DECODER_CONFIG();
    esp_audio_codec_lib_add(player, AUDIO_CODEC_TYPE_DECODER,
                            esp_decoder_init(&auto_dec_cfg, auto_decode, 5));

    /* ── I2S stream writer
     *    out_rb = 256KB：PSRAM 缓冲，彻底杜绝 DMA underrun
     *    task_core = 1：与 WiFi（core0）分开，避免竞争
     *    task_prio = 9：最高优先级，及时喂 DMA
     */
    i2s_stream_cfg_t i2s_writer = I2S_STREAM_CFG_DEFAULT();
    i2s_writer.type             = AUDIO_STREAM_WRITER;
    i2s_writer.stack_in_ext     = true;
    i2s_writer.task_prio        = 9;
    i2s_writer.task_core        = 1;
    i2s_writer.task_stack       = 4 * 1024;
    i2s_writer.out_rb_size      = 256 * 1024;  /* 256KB PSRAM，杜绝 underrun */
    i2s_writer.use_alc          = true;
    s_i2s_el = i2s_stream_init(&i2s_writer);
    i2s_stream_set_clk(s_i2s_el, 48000, 16, 2);
    esp_audio_output_stream_add(player, s_i2s_el);

    /* ── 起手音量 ── */
    _my_vol_set(NULL, s_vol);
    esp_audio_callback_set(player, player_event_handler, NULL);

    ESP_LOGI(TAG, "Audio player ready (http_rb=%d, i2s_rb=%d, req=%d, in_buf=%d, out_buf=%d)",
             http_cfg.out_rb_size, i2s_writer.out_rb_size, http_cfg.request_size,
             cfg.in_stream_buf_size, cfg.out_stream_buf_size);
}

/* ─────────────────────── 采样率跟随 ───────────────────────
 * 参考 Jw-Y1: I2S 跟随源采样率，不做强制重采样（省 CPU、保音质）。
 * 独立 task 周期读取 esp_audio 音乐信息，检测到采样率变化时更新 I2S clk。
 */
static void audio_rate_follow_task(void *arg)
{
    (void)arg;
    esp_audio_music_info_t info;
    int last_rate = 0;
    while (1) {
        vTaskDelay(pdMS_TO_TICKS(500));
        if (!player || !s_i2s_el) continue;
        if (get_state() != PS_PLAYING) continue;
        if (esp_audio_music_info_get(player, &info) == ESP_ERR_AUDIO_NO_ERROR) {
            if (info.sample_rates > 0 && info.sample_rates != last_rate) {
                ESP_LOGI(TAG, "I2S rate follow: %d -> %d Hz (%dch)",
                         last_rate, info.sample_rates, info.channels);
                int ch = (info.channels == 1) ? 1 : 2;
                i2s_stream_set_clk(s_i2s_el, info.sample_rates, 16, ch);
                last_rate = info.sample_rates;
            }
        }
    }
}

/* ─────────────────────── Rotary encoder ─────────────────────── */
static void _enc_on_btn(void *arg)
{
    (void)arg;
    play_state_t cur = get_state();
    if (cur == PS_PLAYING) {
        cb_pause();
    } else if (cur == PS_PAUSED) {
        cb_play();
    } else if (s_track_uri != NULL) {
        cb_play();
    }
}

