MYHealer/dlna-esp32/main/dlna.c
static void _enc_on_rotate(void *arg, int direction)
{
    (void)arg;
    int step = 5;
    int new_vol = s_vol + (direction > 0 ? step : -step);
    if (new_vol < 0)   new_vol = 0;
    if (new_vol > 100) new_vol = 100;
    cb_set_volume(new_vol);
    ESP_LOGI(TAG, "Volume -> %d", new_vol);
}

/* IO13 歌词切换按键（软件消抖 300ms） */
static volatile bool s_lyrics_toggle_pending = false;
static volatile int64_t s_last_lyrics_btn_us = 0;

static void IRAM_ATTR btn_lyrics_isr(void *arg)
{
    (void)arg;
    int64_t now = esp_timer_get_time();
    if (now - s_last_lyrics_btn_us < 300000) return;  /* 300ms 消抖 */
    s_last_lyrics_btn_us = now;
    s_lyrics_toggle_pending = true;
}

static void lyrics_btn_setup(void)
{
    gpio_config_t io = {
        .pin_bit_mask = (1ULL << 13),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .intr_type = GPIO_INTR_NEGEDGE,
    };
    gpio_config(&io);
    gpio_install_isr_service(ESP_INTR_FLAG_IRAM);
    gpio_isr_handler_add(13, btn_lyrics_isr, NULL);
    ESP_LOGI(TAG, "Lyrics button ready (IO13)");
}

static void rotary_encoder_setup(void)
{
    esp_err_t ret = gpio_install_isr_service(ESP_INTR_FLAG_IRAM);
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(TAG, "gpio_install_isr_service failed: %s", esp_err_to_name(ret));
        return;
    }
    /* 旋钮回调从 LVGL 输入驱动获取（旋转=焦点切换，按下=选中） */
    void (*rot_cb)(void*, int) = NULL;
    void (*btn_cb)(void*)      = NULL;
    lvgl_port_get_encoder_callbacks(&rot_cb, &btn_cb);
    rotary_encoder_config_t cfg = {
        .clk_gpio     = 4,
        .dt_gpio      = 5,
        .sw_gpio      = 6,
        .on_rotate    = rot_cb,
        .on_btn_click = btn_cb,
        .arg          = NULL,
    };
    ret = rotary_encoder_init(&cfg);
    if (ret != ESP_OK)
        ESP_LOGE(TAG, "rotary_encoder_init failed: %s", esp_err_to_name(ret));
    else
        ESP_LOGI(TAG, "Rotary encoder ready (CLK=4, DT=5, SW=6)");
}

/* ─────────────────────── Start DLNA ─────────────────────── */
static void start_dlna(void)
{
    static const custom_dlna_config_t cfg = {
        .friendly_name     = "MS01B",
        .uuid              = DLNA_DEVICE_UUID,
        .port              = 8080,

        .get_transport_state = cb_get_transport_state,
        .get_uri             = cb_get_uri,
        .get_position_sec    = cb_get_position_sec,
        .get_position_ms     = cb_get_position_ms,
        .get_duration_sec    = cb_get_duration_sec,
        .get_volume          = cb_get_volume,
        .get_mute            = cb_get_mute,

        .on_set_uri       = cb_set_uri,
        .on_set_next_uri   = cb_set_next_uri,
        .on_set_metadata   = cb_set_metadata,
        .on_play           = cb_play,
        .on_pause          = cb_pause,
        .on_stop           = cb_stop,
        .on_seek           = cb_seek,
        .on_set_volume     = cb_set_volume,
        .on_set_mute       = cb_set_mute,
        .on_next           = cb_next,
        .on_previous       = cb_previous,
    };
    custom_dlna_init(&cfg);
    ESP_LOGI(TAG, "Custom DLNA started (host=ESP32-S3-DLNA)");
}

/* ─────────────────────── LVGL UI 更新任务 ── */

/* 获取当前播放位置（毫秒） */
static int get_position_ms(void)
{
    if (s_play_start_us > 0) {
        return s_accumulated_ms +
               (int)((esp_timer_get_time() - s_play_start_us) / 1000LL);
    }
    return s_accumulated_ms;
}

/* ── UTF-8 字符数 → 字节偏移 ── */
static int utf8_byte_offset(const char *s, int char_idx)
{
    int count = 0, offset = 0;
    while (s[offset] && count < char_idx) {
        if ((s[offset] & 0xC0) != 0x80) count++;
        offset++;
    }
    return offset;
}

static int utf8_char_count(const char *s)
{
    int count = 0;
    while (*s) {
        if ((*s & 0xC0) != 0x80) count++;
        s++;
    }
    return count;
}

static void ui_update_task(void *arg)
{
    (void)arg;
    int tick = 0;
    int last_cur_line = -1;
    while (1) {
        vTaskDelay(pdMS_TO_TICKS(40));

        lvgl_port_lock();

        /* 检查 IO13 歌词切换请求 */
        if (s_lyrics_toggle_pending) {
            s_lyrics_toggle_pending = false;
            lvgl_port_ui_toggle_lyrics();
        }
        /* 清除歌词标签（新歌/切歌时） */
        if (s_lyrics_ui_clear_pending) {
            s_lyrics_ui_clear_pending = false;
            lvgl_port_ui_lyrics_clear();
            last_cur_line = -1;
        }

        int pos_ms = get_position_ms();
        int pos_sec = pos_ms / 1000;
        ESP_LOGI(TAG, "UI: pos=%d dur=%d state=%d", pos_sec, s_dur_cache_sec, (int)get_state());
        lvgl_port_ui_set_progress(pos_sec, s_dur_cache_sec);
        lvgl_port_ui_set_state((int)get_state());
        lvgl_port_ui_set_volume(s_vol);

        const lyric_data_t *lyr = lyrics_get_data();
        if (lyr && lyr->loaded && lyr->count > 0) {
            int cur = lyrics_get_current_line(pos_ms);
            const char *prev = (cur > 0) ? lyr->lines[cur - 1].text : "";
            const char *curr = lyr->lines[cur].text;
            const char *next = (cur + 1 < lyr->count) ? lyr->lines[cur + 1].text : "";

            /* 行切换时才更新歌词文本（避免复位滚动位置） */
            if (cur != last_cur_line) {
                last_cur_line = cur;
                lvgl_port_ui_lyrics_update(cur, prev, curr, next);
                /* 滚动速率与这句歌词时长相绑定 */
                int line_start = lyr->lines[cur].time_ms;
                int line_end = (cur + 1 < lyr->count)
                    ? lyr->lines[cur + 1].time_ms
                    : s_dur_cache_sec * 1000;
                if (line_end <= line_start) line_end = line_start + 5000;
                lvgl_port_ui_lyrics_scroll_to_end(line_end - line_start);
            }

            /* 每 tick 更新逐字高亮（karaoke） */
            if (cur >= 0 && cur < lyr->count && curr[0]) {
                int total_chars = utf8_char_count(curr);
                int progress;
                /* 优先用 klyric 逐字时间轴，精确到毫秒 */
                int kprog = lyrics_get_karaoke_progress(lyr->lines[cur].time_ms, pos_ms);
                if (kprog >= 0) {
                    progress = kprog;
                } else {
                    /* 回退到字数估算，避免伴奏停顿拖慢高亮 */
                    static bool s_klyric_warned = false;
                    if (!s_klyric_warned) {
                        s_klyric_warned = true;
                        ESP_LOGW(TAG, "klyric: NOT AVAILABLE for line=%d/%d pos=%d (fallback to estimation)",
                            cur, lyr->count, pos_ms);
                    }
                    /* 按行时长估算演唱时长，自适应歌曲节奏 */
                    int line_start = lyr->lines[cur].time_ms;
                    int line_end = (cur + 1 < lyr->count)
                        ? lyr->lines[cur + 1].time_ms
                        : s_dur_cache_sec * 1000;
                    if (line_end <= line_start) line_end = line_start + 5000;
                    int line_dur = line_end - line_start;
                    /* 用行时长的 80% 估算，快歌行短自动快，慢歌行长安逸 */
                    /* 慢歌高亮完最后一字应接近下一句出现，避免干等 */
                    int est_sing = line_dur * 80 / 100;
                    if (est_sing < 800) est_sing = 800;
                    progress = (pos_ms - line_start) * 100 / est_sing;
                }
                if (progress < 0) progress = 0;
                if (progress > 100) progress = 100;
                int char_idx = total_chars * progress / 100;
                int byte_idx = utf8_byte_offset(curr, char_idx);
                lvgl_port_ui_lyrics_karaoke(byte_idx);
            }
        } else {
            last_cur_line = -1;
        }

