MYHealer/dlna-esp32/main/dlna.c
        /* ── 主动播完检测（参考 miair-next _check_play_status）──
         * 软件位置接近曲末但底层未触发 FINISHED 时的兜底。
         * 连续 30 tick（~1.2s）剩余 <1.5s 时触发。 */
        if (get_state() == PS_PLAYING && s_dur_cache_sec > 0 && !s_finish_notify_spawned) {
            int remain_ms = s_dur_cache_sec * 1000 - get_position_ms();
            if (remain_ms < 1500) {
                if (++s_near_end_count >= 30) {
                    s_near_end_count = 0;
                    ESP_LOGI(TAG, "Software near-end detected (remain=%d), forcing completion", remain_ms);
                    xTaskCreatePinnedToCore(delayed_stop_notify, "stop_dly", 3072, NULL, 5, NULL, 1);
                }
            } else {
                s_near_end_count = 0;
            }
        } else {
            s_near_end_count = 0;
        }

        /* 每 tick 缓慢左移当前行 */
        lvgl_port_ui_lyrics_tick_scroll();

        lvgl_port_unlock();

        if ((++tick % 125) == 0) ESP_LOGI(TAG, "UI tick alive");
    }
}

/* ─────────────────────── Entry point ─────────────────────── */
void app_main(void)
{
    esp_log_level_set("*", ESP_LOG_INFO);
    esp_log_level_set(TAG, ESP_LOG_DEBUG);
    esp_log_level_set("AUDIO_ELEMENT", ESP_LOG_WARN);
    esp_log_level_set("AUDIO_PIPELINE", ESP_LOG_ERROR);
    esp_log_level_set("ESP_AUDIO_CTRL", ESP_LOG_WARN);
    /* 诊断卡顿：临时提高 HTTP/解码/内存日志级别 */
    esp_log_level_set("HTTP_STREAM", ESP_LOG_DEBUG);
    esp_log_level_set("ESP_AUDIO_TASK", ESP_LOG_DEBUG);
    esp_log_level_set("esp_http_client", ESP_LOG_DEBUG);
    esp_log_level_set("esp_netif_lwip", ESP_LOG_WARN);
    esp_log_level_set("LYRIC", ESP_LOG_DEBUG);
    media_lib_add_default_adapter();

    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 1, 0))
    ESP_ERROR_CHECK(esp_netif_init());
#else
    tcpip_adapter_init();
#endif

    /* ── 状态互斥锁（必须在其他组件之前创建）── */
    s_state_mux = xSemaphoreCreateMutex();

    /* ── WiFi
     *   关键点：关闭省电模式 + 固定主机名，从 airplay-esp32 参考过来。
     */
    {
        esp_periph_config_t periph_cfg = DEFAULT_ESP_PERIPH_SET_CONFIG();
        esp_periph_set_handle_t set = esp_periph_set_init(&periph_cfg);

        periph_wifi_cfg_t wifi_cfg = {
            .wifi_config.sta.ssid = CONFIG_WIFI_SSID,
            .wifi_config.sta.password = CONFIG_WIFI_PASSWORD,
            .wifi_config.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK,
            .wifi_config.sta.pmf_cfg.capable = false,
            .wifi_config.sta.pmf_cfg.required = false,
            .wifi_config.sta.listen_interval = 1,
            .reconnect_timeout_ms = 5000,
            .disable_auto_reconnect = false,
        };
        esp_periph_handle_t wifi_handle = periph_wifi_init(&wifi_cfg);
        esp_periph_start(set, wifi_handle);
        periph_wifi_wait_for_connected(wifi_handle, pdMS_TO_TICKS(15000));
        ESP_LOGI(TAG, "WiFi %s", periph_wifi_is_connected(wifi_handle) ? "connected" : "timeout, continuing...");
    }

    /* ── 主机名 + WiFi 协议/功耗
     *   路由器 UI / mDNS / 网络邻居 里就能看到 "ESP32-S3-DLNA"。
     */
    {
        esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
        if (sta_netif) esp_netif_set_hostname(sta_netif, "ESP32-S3-DLNA");
    }
    esp_wifi_set_ps(WIFI_PS_NONE);
    esp_wifi_set_protocol(ESP_IF_WIFI_STA,
                          WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N);
    esp_wifi_set_max_tx_power(78);

    /* ── 音频播放 ── */
    audio_player_init();

    /* ── 采样率跟随（I2S 动态匹配源采样率，core1）── */
    xTaskCreatePinnedToCore(audio_rate_follow_task, "rate_follow", 4096, NULL, 4, NULL, 1);

    /* ── DLNA 服务（SSDP + HTTP + SOAP）── */
    start_dlna();

    /* ── 旋钮（UI）── */
    rotary_encoder_setup();
    lyrics_btn_setup();

    /* ── TFT 显示 + LVGL ── */
    tft_init();
    lvgl_port_init(5);

    /* 旋钮焦点框选 → 播放控制 */
    lvgl_port_ui_register_btn_prev_cb(cb_previous);
    lvgl_port_ui_register_btn_play_cb(cb_play_toggle);
    lvgl_port_ui_register_btn_next_cb(cb_next);

    lyrics_init();
    xTaskCreatePinnedToCore(ui_update_task, "ui_update", 4096, NULL, 3, NULL, 0);
}
